# Librería Pandas (tipos de dato)

In [1]:
import pandas as pd

<div style="background-color:lightpink; padding:1em"><p><b>Ejercicio 1</b><br/>
    Defina la siguiente serie de datos con un índice de enteros y cadenas de caracteres como valores: <br/>
</p>
    <table> 
        <tr><th>Índice</th><th>Valores</th></tr>
        <tr><td>10</td><td>X</td></tr>
        <tr><td>20</td><td>XX</td></tr>
        <tr><td>30</td><td>XXX</td></tr>
        <tr><td>40</td><td>XL</td></tr>
        <tr><td>50</td><td>L</td></tr>
    </table>
    
</div>

In [2]:
pd.Series( ["X", "XX", "XXX", "XL", "L"], index=[10, 20, 30, 40, 50])

10      X
20     XX
30    XXX
40     XL
50      L
dtype: object

<p style="background-color:lightpink; padding:1em"><b>Ejercicio 2</b><br/>
    Defina una función que, dado un número entero entre 1 y 5, devuelva una cadena con su valor en números romanos. Aplique dicha función a la serie <code>s2</code>.
</p>

Solución 1:

In [12]:
s2 = pd.Series([1, 1, 3, 2, 2, 1, 3])

def romano(valor):
    valores_romanos = [None, "I", "II", "III", "IV", "V"]
    return valores_romanos[valor]

s2.apply(romano)

0      I
1      I
2    III
3     II
4     II
5      I
6    III
dtype: object

Solución 2:

In [4]:
s2 = pd.Series([1, 1, 3, 2, 2, 1, 3])

def romano(valor):
    valores_romanos = pd.Series(["I", "II", "III", "IV", "V"], index=[1, 2, 3, 4, 5])
    return valores_romanos.loc[valor]

s2.apply(romano)

0      I
1      I
2    III
3     II
4     II
5      I
6    III
dtype: object

<p style="background-color:lightpink; padding:1em"><b>Ejercicio 3</b><br/>
    Sobre <code>s2</code> aplique una ventana deslizante de tamaño 2 y calcule, para cada posición, la diferencia entre el elemento actual y el anterior (diferenciación).
</p>

In [25]:
def diferenciar(x):
    return x.iloc[1] - x.iloc[0]

s2.rolling(2).apply( diferenciar )

0    NaN
1    0.0
2    2.0
3   -1.0
4    0.0
5   -1.0
6    2.0
dtype: float64

<p style="background-color:lightpink; padding:1em"><b>Ejercicio 4</b><br/>
    Complete la tabla con los datos de los alumnos que faltan <br/>
</p>

In [6]:
alumnos = pd.DataFrame(index=[0,1,2,3,4], 
                       columns=["Nombre", "Edad", "Matriculado"])

alumnos.loc[0,:] = ("Antonio", 22, False)
alumnos.loc[1,:] = ("Berta", 43, True)
alumnos.loc[2,:] = ("Carlos", 24, True)
alumnos.loc[3,:] = ("Diana", 34, False)
alumnos.loc[4,:] = ("Esteban", 33, True)

alumnos

    Nombre Edad Matriculado
0  Antonio   22       False
1    Berta   43        True
2   Carlos   24        True
3    Diana   34       False
4  Esteban   33        True

<p style="background-color:lightpink; padding:1em"><b>Ejercicio 5</b><br/>
    Elimine la fila <code>3</code> de la tabla <code>alumnos</code>.
</p>

Valor que tiene <code>alumnos</code> en este punto de la libreta:

In [7]:
alumnos = pd.DataFrame(columns=["Nombre", "Edad", "Matriculado", "Nota", "Residencia"],
                       index=[0, 1, 3, 5, 6],
                       data = [["Antonio", 22, False, 7.5, "Alhaurin"],
                               ["Berta", 43, True, 4.5, "Benalmádena"],
                               ["Diana", 34, False, 9.4, None],
                               ["Fátima", 23, True, 8.7, "Frigiliana"],
                               ["Gonzalo", 30, True, 7.7, "Guaro"]
                              ]
                      )
alumnos

    Nombre  Edad  Matriculado  Nota   Residencia
0  Antonio    22        False   7.5     Alhaurin
1    Berta    43         True   4.5  Benalmádena
3    Diana    34        False   9.4         None
5   Fátima    23         True   8.7   Frigiliana
6  Gonzalo    30         True   7.7        Guaro

Solución del ejercicio:

In [8]:
alumnos = alumnos.drop(3)
alumnos

    Nombre  Edad  Matriculado  Nota   Residencia
0  Antonio    22        False   7.5     Alhaurin
1    Berta    43         True   4.5  Benalmádena
5   Fátima    23         True   8.7   Frigiliana
6  Gonzalo    30         True   7.7        Guaro

<div style="background-color:lightpink; padding:1em">
<p ><b>Ejercicio 6</b><br/>
    Defina una función que reciba una fila, y haga lo siguiente:
    <ul>
        <li>Si el alumno está matriculado, devolver su nota</li>
        <li>Si el alumno no está matriculado, devolver 0</li>
    </ul>
    Aplíquela sobre la tabla <code>alumnos</code> y añada el resultado como una nueva columna.
</p>
</div>

Solución 1:

In [9]:
def nueva_nota(fila):
    if fila["Matriculado"]:     # No hace falta poner if valor == True, cuando valor es booleano pero tampoco fallará si lo hacemos
        return fila["Nota"]
    else:
        return 0
    
alumnos["Nueva nota"] = alumnos.apply(nueva_nota, axis=1)
alumnos

    Nombre  Edad  Matriculado  Nota   Residencia  Nueva nota
0  Antonio    22        False   7.5     Alhaurin         0.0
1    Berta    43         True   4.5  Benalmádena         4.5
5   Fátima    23         True   8.7   Frigiliana         8.7
6  Gonzalo    30         True   7.7        Guaro         7.7

Solución 2 (más limpia):

In [10]:
def nueva_nota(fila):
    return fila["Matriculado"] * fila["Nota"]   # En operaciones numéricas, un booleano vale 1 (True) o 0 (False)

alumnos["Nueva nota"] = alumnos.apply(nueva_nota, axis=1)
alumnos

    Nombre  Edad  Matriculado  Nota   Residencia  Nueva nota
0  Antonio    22        False   7.5     Alhaurin         0.0
1    Berta    43         True   4.5  Benalmádena         4.5
5   Fátima    23         True   8.7   Frigiliana         8.7
6  Gonzalo    30         True   7.7        Guaro         7.7

Forma alternativa (no es lo que se pide en el ejercicio, pero es más limpio):

In [11]:
alumnos["Nueva nota"] = alumnos["Matriculado"] * alumnos["Nota"]
alumnos

    Nombre  Edad  Matriculado  Nota   Residencia  Nueva nota
0  Antonio    22        False   7.5     Alhaurin         0.0
1    Berta    43         True   4.5  Benalmádena         4.5
5   Fátima    23         True   8.7   Frigiliana         8.7
6  Gonzalo    30         True   7.7        Guaro         7.7